LengmoAngel/Rimuru/2.Firmware/Libraries/mm/Core/Inc/mm32f3273g.h
/*
 * Copyright 2021 MindMotion Microelectronics Co., Ltd.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef __MM32F3273G_H__
#define __MM32F3273G_H__

/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
#define NUMBER_OF_INT_VECTORS 75                 /**< Number of interrupts in the Vector table */

typedef enum IRQ {
  NMI_IRQn                              = -14,                                   /*!< Non Maskable Interrupt                 */
  HardFault_IRQn                        = -13,                                   /*!< Cortex-M3 SV Hard Fault Interrupt   */
  MemManage_IRQn                        = -12,                                   /*!< Cortex-M3 Memory Management Interrupt  */
  BusFault_IRQn                         = -11,                                   /*!< Cortex-M3 Bus Fault Interrupt  */
  UsageFault_IRQn                       = -10,                                   /*!< Cortex-M3 Usage Fault Interrupt  */
  SVCall_IRQn                           = -4,                                    /*!< Cortex-M3 SV Call Interrupt  */
  DebugMonitor_IRQn                     = -3,                                    /*!< Cortex-M3 Debug Monitor Interrupt  */
  PendSV_IRQn                           = -2,                                    /*!< Cortex-M3 Pend SV Interrupt  */
  SysTick_IRQn                          = -1,                                    /*!< Cortex-M3 System Tick Interrupt  */
  WWDG_IWDG_IRQn                        = 0,                                     /*!< Window watchdog interrupt */
  PVD_VDT_IRQn                          = 1,                                     /*!< (PVD) and (VDT) interrupt */
  TAMPER_IRQn                           = 2,                                     /*!< Intrusion detection interrupted */
  RTC_IRQn                              = 3,                                     /*!< RTC global interrupt */
  FLASH_IRQn                            = 4,                                     /*!< Flash global interrupt */
  RCC_CRS_IRQn                          = 5,                                     /*!< RCC and CRS global interrupt */
  EXTI0_IRQn                            = 6,                                     /*!< EXTI line 0 interrupt */
  EXTI1_IRQn                            = 7,                                     /*!< EXTI line 1 interrupted */
  EXTI2_IRQn                            = 8,                                     /*!< EXTI line 2 interrupted */
  EXTI3_IRQn                            = 9,                                     /*!< EXTI line 3 interrupted */
  EXTI4_IRQn                            = 10,                                    /*!< EXTI line 4 interrupted */
  DMA1_CH1_IRQn                         = 11,                                    /*!< DMA1 channel 1 global interrupt */
  DMA1_CH2_IRQn                         = 12,                                    /*!< DMA1 channel 2 global interrupt */
  DMA1_CH3_IRQn                         = 13,                                    /*!< DMA1 channel 3 global interrupt */
  DMA1_CH4_IRQn                         = 14,                                    /*!< DMA1 channel 4 global interrupt */
  DMA1_CH5_IRQn                         = 15,                                    /*!< DMA1 channel 5 global interrupt */
  DMA1_CH6_IRQn                         = 16,                                    /*!< DMA1 channel 6 global interrupt */
  DMA1_CH7_IRQn                         = 17,                                    /*!< DMA1 channel 7 global interrupt */
  ADC1_ADC2_IRQn                        = 18,                                    /*!< ADC1 and ADC2 global interrupt */
  Cache_IRQn                            = 19,                                    /*!< Cache global interrupt */
  CAN1_RX_IRQn                          = 21,                                    /*!< CAN1 accept interrupt */
  EXTI9_5_IRQn                          = 23,                                    /*!< EXTI line [9:5] is interrupted */
  TIM1_BRK_IRQn                         = 24,                                    /*!< TIM1 brake interruption */
  TIM1_UP_IRQn                          = 25,                                    /*!< TIM1 update interrupt */
  TIM1_TRG_COM_IRQn                     = 26,                                    /*!< TIM1 trigger, communication interruption */
  TIM1_CC_IRQn                          = 27,                                    /*!< TIM1 capture compare interrupt */
  TIM2_IRQn                             = 28,                                    /*!< TIM2 global interrupt */
  TIM3_IRQn                             = 29,                                    /*!< TIM3 global interrupt */
  TIM4_IRQn                             = 30,                                    /*!< TIM4 global interrupt */
  I2C1_IRQn                             = 31,                                    /*!< I2C1 global interrupt */
  I2C2_IRQn                             = 33,                                    /*!< I2C2 global interrupt */
  SPI1_IRQn                             = 35,                                    /*!< SPI1 global interrupt */
  SPI2_IRQn                             = 36,                                    /*!< SPI2 global interrupt */
  UART1_IRQn                            = 37,                                    /*!< UART1 global interrupt */
  UART2_IRQn                            = 38,                                    /*!< UART2 global interrupt */
  UART3_IRQn                            = 39,                                    /*!< UART3 global interrupt */
  EXTI15_10_IRQn                        = 40,                                    /*!< EXTI line [15:10] is interrupted */
  RTC_Alarm_IRQn                        = 41,                                    /*!< RTC alarm interrupt */
  USB_WKUP_IRQn                         = 42,                                    /*!< USB wakeup interrupt */
  TIM8_BRK_IRQn                         = 43,                                    /*!< TIM8 brake interruption */
  TIM8_UP_IRQn                          = 44,                                    /*!< TIM8 update interrupt */
  TIM8_TRG_COM_IRQn                     = 45,                                    /*!< TIM8 trigger, communication interruption */
  TIM8_CC_IRQn                          = 46,                                    /*!< TIM8 capture compare interrupt */
  ADC3_IRQn                             = 47,                                    /*!< ADC3 global interrupt */
  SDIO_IRQn                             = 49,                                    /*!< SDIO global interrupt */
  TIM5_IRQn                             = 50,                                    /*!< TIM5 global interrupt */
  SPI3_IRQn                             = 51,                                    /*!< SPI3 global interrupt */
  UART4_IRQn                            = 52,                                    /*!< UART4 global interrupt */
  UART5_IRQn                            = 53,                                    /*!< UART5 global interrupt */
  TIM6_IRQn                             = 54,                                    /*!< TIM6 global interrupt */
  TIM7_IRQn                             = 55,                                    /*!< TIM7 global interrupt */
  DMA2_CH1_IRQn                         = 56,                                    /*!< DMA2 channel 1 global interrupt */
  DMA2_CH2_IRQn                         = 57,                                    /*!< DMA2 channel 2 global interrupt */
  DMA2_CH3_IRQn                         = 58,                                    /*!< DMA2 channel 3 global interrupt */
  DMA2_CH4_IRQn                         = 59,                                    /*!< DMA2 channel 4 global interrupt */
  DMA2_CH5_IRQn                         = 60,                                    /*!< DMA2 channel 5 global interrupt */
  COMP1_2_IRQn                          = 64,                                    /*!< Comparator 1/2 interrupt */
  USB_FS_IRQn                           = 67,                                    /*!< USB FS global interrupt */
  UART6_IRQn                            = 71,                                    /*!< UART6 global interrupt */
  UART7_IRQn                            = 82,                                    /*!< UART7 global interrupt */
  UART8_IRQn                            = 83,                                    /*!< UART8 global interrupt */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Cortex M3 Core Configuration
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Cortex_Core_Configuration Cortex M33 Core Configuration
 * @{
 */

#define __MPU_PRESENT                  0         /**< Defines if an MPU is present or not */
#define __NVIC_PRIO_BITS               3         /**< Number of priority bits implemented in the NVIC */
#define __Vendor_SysTickConfig         0         /**< Vendor specific implementation of SysTickConfig is defined */
#define __FPU_PRESENT                  0         /**< Defines if an FPU is present or not */
#define __DSP_PRESENT                  0         /**< Defines if Armv8-M Mainline core supports DSP instructions */
#define __SAUREGION_PRESENT            0         /**< Defines if an SAU is present or not */

#include "core_cm3.h"                 /* Core Peripheral Access Layer */

/*!
 * @}
 */ /* end of group Cortex_Core_Configuration */




/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


