LengmoAngel/Rimuru/2.Firmware/Libraries/mm/Core/Inc/mm32f3273g.h
/*******************************************************************************
 * SYSCFG Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CFGR;                                                           ///< SYSCFG configuration register                offset: 0x00
    __IO uint32_t Reserved4[1];                                                   ///< Reserved
    __IO uint32_t EXTICR1;                                                        ///< External interrupt configuration register 1  offset: 0x08
    __IO uint32_t EXTICR2;                                                        ///< External interrupt configuration register 2  offset: 0x0C
    __IO uint32_t EXTICR3;                                                        ///< External interrupt configuration register 3  offset: 0x10
    __IO uint32_t EXTICR4;                                                        ///< External interrupt configuration register 4  offset: 0x14
    __IO uint32_t CFGR2;                                                          ///< SYSCFG configuration register 2              offset: 0x18
    __IO uint32_t PDETCSR;                                                        ///< Power detection configuration status registeroffset: 0x1C
    __IO uint32_t VOSDLY;                                                         ///< VOSDLY configuration register                offset: 0x20
} SYSCFG_Type;

/*******************************************************************************
 * SYSCFG Type
 ******************************************************************************/

/*!
 * @addtogroup SYSCFG_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief SYSCFG_CFGR Register Bit Definition
 */

#define SYSCFG_CFGR_MODESEL_SHIFT               (29)
#define SYSCFG_CFGR_MODESEL_MASK                (0x3U << SYSCFG_CFGR_MODESEL_SHIFT)
#define SYSCFG_CFGR_MODESEL(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_MODESEL_SHIFT)) & SYSCFG_CFGR_MODESEL_MASK)

#define SYSCFG_CFGR_FCODATAEN_SHIFT             (28)
#define SYSCFG_CFGR_FCODATAEN_MASK              (0x01U << SYSCFG_CFGR_FCODATAEN_SHIFT)
#define SYSCFG_CFGR_FCODATAEN(x)                (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_FCODATAEN_SHIFT)) & SYSCFG_CFGR_FCODATAEN_MASK)

#define SYSCFG_CFGR_MEMMODE_SHIFT               (0)
#define SYSCFG_CFGR_MEMMODE_MASK                (0x3U << SYSCFG_CFGR_MEMMODE_SHIFT)
#define SYSCFG_CFGR_MEMMODE(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_MEMMODE_SHIFT)) & SYSCFG_CFGR_MEMMODE_MASK)

/*!
 * @brief SYSCFG_EXTICR1 Register Bit Definition
 */

#define SYSCFG_EXTICR1_EXTIX_SHIFT              (0)
#define SYSCFG_EXTICR1_EXTIX_MASK               (0xFFFFU << SYSCFG_EXTICR1_EXTIX_SHIFT)
#define SYSCFG_EXTICR1_EXTIX(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR1_EXTIX_SHIFT)) & SYSCFG_EXTICR1_EXTIX_MASK)

/*!
 * @brief SYSCFG_EXTICR2 Register Bit Definition
 */

#define SYSCFG_EXTICR2_EXTIX_SHIFT              (0)
#define SYSCFG_EXTICR2_EXTIX_MASK               (0xFFFFU << SYSCFG_EXTICR2_EXTIX_SHIFT)
#define SYSCFG_EXTICR2_EXTIX(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR2_EXTIX_SHIFT)) & SYSCFG_EXTICR2_EXTIX_MASK)

/*!
 * @brief SYSCFG_EXTICR3 Register Bit Definition
 */

#define SYSCFG_EXTICR3_EXTIX_SHIFT              (0)
#define SYSCFG_EXTICR3_EXTIX_MASK               (0xFFFFU << SYSCFG_EXTICR3_EXTIX_SHIFT)
#define SYSCFG_EXTICR3_EXTIX(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR3_EXTIX_SHIFT)) & SYSCFG_EXTICR3_EXTIX_MASK)

/*!
 * @brief SYSCFG_EXTICR4 Register Bit Definition
 */

#define SYSCFG_EXTICR4_EXTIX_SHIFT              (0)
#define SYSCFG_EXTICR4_EXTIX_MASK               (0xFFFFU << SYSCFG_EXTICR4_EXTIX_SHIFT)
#define SYSCFG_EXTICR4_EXTIX(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR4_EXTIX_SHIFT)) & SYSCFG_EXTICR4_EXTIX_MASK)

/*!
 * @brief SYSCFG_CFGR2 Register Bit Definition
 */

#define SYSCFG_CFGR2_MACSPDSEL_SHIFT            (21)
#define SYSCFG_CFGR2_MACSPDSEL_MASK             (0x01U << SYSCFG_CFGR2_MACSPDSEL_SHIFT)
#define SYSCFG_CFGR2_MACSPDSEL(x)               (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR2_MACSPDSEL_SHIFT)) & SYSCFG_CFGR2_MACSPDSEL_MASK)

#define SYSCFG_CFGR2_MIIRMIISEL_SHIFT           (20)
#define SYSCFG_CFGR2_MIIRMIISEL_MASK            (0x01U << SYSCFG_CFGR2_MIIRMIISEL_SHIFT)
#define SYSCFG_CFGR2_MIIRMIISEL(x)              (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR2_MIIRMIISEL_SHIFT)) & SYSCFG_CFGR2_MIIRMIISEL_MASK)

#define SYSCFG_CFGR2_I2C2MODESEL_SHIFT          (17)
#define SYSCFG_CFGR2_I2C2MODESEL_MASK           (0x01U << SYSCFG_CFGR2_I2C2MODESEL_SHIFT)
#define SYSCFG_CFGR2_I2C2MODESEL(x)             (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR2_I2C2MODESEL_SHIFT)) & SYSCFG_CFGR2_I2C2MODESEL_MASK)

#define SYSCFG_CFGR2_I2C1MODESEL_SHIFT          (16)
#define SYSCFG_CFGR2_I2C1MODESEL_MASK           (0x01U << SYSCFG_CFGR2_I2C1MODESEL_SHIFT)
#define SYSCFG_CFGR2_I2C1MODESEL(x)             (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR2_I2C1MODESEL_SHIFT)) & SYSCFG_CFGR2_I2C1MODESEL_MASK)

/*!
 * @brief SYSCFG_PDETCSR Register Bit Definition
 */

#define SYSCFG_PDETCSR_VBATDIV3EN_SHIFT         (11)
#define SYSCFG_PDETCSR_VBATDIV3EN_MASK          (0x01U << SYSCFG_PDETCSR_VBATDIV3EN_SHIFT)
#define SYSCFG_PDETCSR_VBATDIV3EN(x)            (((uint32_t)(((uint32_t)(x)) << SYSCFG_PDETCSR_VBATDIV3EN_SHIFT)) & SYSCFG_PDETCSR_VBATDIV3EN_MASK)

#define SYSCFG_PDETCSR_VDTLS_SHIFT              (9)
#define SYSCFG_PDETCSR_VDTLS_MASK               (0x3U << SYSCFG_PDETCSR_VDTLS_SHIFT)
#define SYSCFG_PDETCSR_VDTLS(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_PDETCSR_VDTLS_SHIFT)) & SYSCFG_PDETCSR_VDTLS_MASK)

#define SYSCFG_PDETCSR_VDTE_SHIFT               (8)
#define SYSCFG_PDETCSR_VDTE_MASK                (0x01U << SYSCFG_PDETCSR_VDTE_SHIFT)
#define SYSCFG_PDETCSR_VDTE(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCFG_PDETCSR_VDTE_SHIFT)) & SYSCFG_PDETCSR_VDTE_MASK)

#define SYSCFG_PDETCSR_VDTO_SHIFT               (6)
#define SYSCFG_PDETCSR_VDTO_MASK                (0x01U << SYSCFG_PDETCSR_VDTO_SHIFT)
#define SYSCFG_PDETCSR_VDTO(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCFG_PDETCSR_VDTO_SHIFT)) & SYSCFG_PDETCSR_VDTO_MASK)

#define SYSCFG_PDETCSR_PVDO_SHIFT               (5)
#define SYSCFG_PDETCSR_PVDO_MASK                (0x01U << SYSCFG_PDETCSR_PVDO_SHIFT)
#define SYSCFG_PDETCSR_PVDO(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCFG_PDETCSR_PVDO_SHIFT)) & SYSCFG_PDETCSR_PVDO_MASK)

#define SYSCFG_PDETCSR_PLS_SHIFT                (1)
#define SYSCFG_PDETCSR_PLS_MASK                 (0xFU << SYSCFG_PDETCSR_PLS_SHIFT)
#define SYSCFG_PDETCSR_PLS(x)                   (((uint32_t)(((uint32_t)(x)) << SYSCFG_PDETCSR_PLS_SHIFT)) & SYSCFG_PDETCSR_PLS_MASK)

