LengmoAngel/Rimuru/2.Firmware/Libraries/mm/Core/Inc/mm32f3273g.h
/*******************************************************************************
 * CAN Type
 ******************************************************************************/

/*!
 * @addtogroup CAN_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief CAN_MOD Register Bit Definition
 */

#define CAN_MOD_AFM_SHIFT                       (3)
#define CAN_MOD_AFM_MASK                        (0x01U << CAN_MOD_AFM_SHIFT)
#define CAN_MOD_AFM(x)                          (((uint32_t)(((uint32_t)(x)) << CAN_MOD_AFM_SHIFT)) & CAN_MOD_AFM_MASK)

#define CAN_MOD_STM_SHIFT                       (2)
#define CAN_MOD_STM_MASK                        (0x01U << CAN_MOD_STM_SHIFT)
#define CAN_MOD_STM(x)                          (((uint32_t)(((uint32_t)(x)) << CAN_MOD_STM_SHIFT)) & CAN_MOD_STM_MASK)

#define CAN_MOD_LOM_SHIFT                       (1)
#define CAN_MOD_LOM_MASK                        (0x01U << CAN_MOD_LOM_SHIFT)
#define CAN_MOD_LOM(x)                          (((uint32_t)(((uint32_t)(x)) << CAN_MOD_LOM_SHIFT)) & CAN_MOD_LOM_MASK)

#define CAN_MOD_RM_SHIFT                        (0)
#define CAN_MOD_RM_MASK                         (0x01U << CAN_MOD_RM_SHIFT)
#define CAN_MOD_RM(x)                           (((uint32_t)(((uint32_t)(x)) << CAN_MOD_RM_SHIFT)) & CAN_MOD_RM_MASK)

/*!
 * @brief CAN_CR Register Bit Definition
 */

#define CAN_CR_OIE_SHIFT                        (4)
#define CAN_CR_OIE_MASK                         (0x01U << CAN_CR_OIE_SHIFT)
#define CAN_CR_OIE(x)                           (((uint32_t)(((uint32_t)(x)) << CAN_CR_OIE_SHIFT)) & CAN_CR_OIE_MASK)

#define CAN_CR_EIE_SHIFT                        (3)
#define CAN_CR_EIE_MASK                         (0x01U << CAN_CR_EIE_SHIFT)
#define CAN_CR_EIE(x)                           (((uint32_t)(((uint32_t)(x)) << CAN_CR_EIE_SHIFT)) & CAN_CR_EIE_MASK)

#define CAN_CR_TIE_SHIFT                        (2)
#define CAN_CR_TIE_MASK                         (0x01U << CAN_CR_TIE_SHIFT)
#define CAN_CR_TIE(x)                           (((uint32_t)(((uint32_t)(x)) << CAN_CR_TIE_SHIFT)) & CAN_CR_TIE_MASK)

#define CAN_CR_RIE_SHIFT                        (1)
#define CAN_CR_RIE_MASK                         (0x01U << CAN_CR_RIE_SHIFT)
#define CAN_CR_RIE(x)                           (((uint32_t)(((uint32_t)(x)) << CAN_CR_RIE_SHIFT)) & CAN_CR_RIE_MASK)

#define CAN_CR_RR_SHIFT                         (0)
#define CAN_CR_RR_MASK                          (0x01U << CAN_CR_RR_SHIFT)
#define CAN_CR_RR(x)                            (((uint32_t)(((uint32_t)(x)) << CAN_CR_RR_SHIFT)) & CAN_CR_RR_MASK)

/*!
 * @brief CAN_CMR Register Bit Definition
 */

#define CAN_CMR_ERB_SHIFT                       (5)
#define CAN_CMR_ERB_MASK                        (0x01U << CAN_CMR_ERB_SHIFT)
#define CAN_CMR_ERB(x)                          (((uint32_t)(((uint32_t)(x)) << CAN_CMR_ERB_SHIFT)) & CAN_CMR_ERB_MASK)

#define CAN_CMR_SRR_SHIFT                       (4)
#define CAN_CMR_SRR_MASK                        (0x01U << CAN_CMR_SRR_SHIFT)
#define CAN_CMR_SRR(x)                          (((uint32_t)(((uint32_t)(x)) << CAN_CMR_SRR_SHIFT)) & CAN_CMR_SRR_MASK)

#define CAN_CMR_CDO_SHIFT                       (3)
#define CAN_CMR_CDO_MASK                        (0x01U << CAN_CMR_CDO_SHIFT)
#define CAN_CMR_CDO(x)                          (((uint32_t)(((uint32_t)(x)) << CAN_CMR_CDO_SHIFT)) & CAN_CMR_CDO_MASK)

#define CAN_CMR_RRB_SHIFT                       (2)
#define CAN_CMR_RRB_MASK                        (0x01U << CAN_CMR_RRB_SHIFT)
#define CAN_CMR_RRB(x)                          (((uint32_t)(((uint32_t)(x)) << CAN_CMR_RRB_SHIFT)) & CAN_CMR_RRB_MASK)

#define CAN_CMR_AT_SHIFT                        (1)
#define CAN_CMR_AT_MASK                         (0x01U << CAN_CMR_AT_SHIFT)
#define CAN_CMR_AT(x)                           (((uint32_t)(((uint32_t)(x)) << CAN_CMR_AT_SHIFT)) & CAN_CMR_AT_MASK)

#define CAN_CMR_TR_SHIFT                        (0)
#define CAN_CMR_TR_MASK                         (0x01U << CAN_CMR_TR_SHIFT)
#define CAN_CMR_TR(x)                           (((uint32_t)(((uint32_t)(x)) << CAN_CMR_TR_SHIFT)) & CAN_CMR_TR_MASK)

/*!
 * @brief CAN_SR Register Bit Definition
 */

#define CAN_SR_BS_SHIFT                         (7)
#define CAN_SR_BS_MASK                          (0x01U << CAN_SR_BS_SHIFT)
#define CAN_SR_BS(x)                            (((uint32_t)(((uint32_t)(x)) << CAN_SR_BS_SHIFT)) & CAN_SR_BS_MASK)

#define CAN_SR_ES_SHIFT                         (6)
#define CAN_SR_ES_MASK                          (0x01U << CAN_SR_ES_SHIFT)
#define CAN_SR_ES(x)                            (((uint32_t)(((uint32_t)(x)) << CAN_SR_ES_SHIFT)) & CAN_SR_ES_MASK)

#define CAN_SR_TS_SHIFT                         (5)
#define CAN_SR_TS_MASK                          (0x01U << CAN_SR_TS_SHIFT)
#define CAN_SR_TS(x)                            (((uint32_t)(((uint32_t)(x)) << CAN_SR_TS_SHIFT)) & CAN_SR_TS_MASK)

#define CAN_SR_RS_SHIFT                         (4)
#define CAN_SR_RS_MASK                          (0x01U << CAN_SR_RS_SHIFT)
#define CAN_SR_RS(x)                            (((uint32_t)(((uint32_t)(x)) << CAN_SR_RS_SHIFT)) & CAN_SR_RS_MASK)

#define CAN_SR_TCS_SHIFT                        (3)
#define CAN_SR_TCS_MASK                         (0x01U << CAN_SR_TCS_SHIFT)
#define CAN_SR_TCS(x)                           (((uint32_t)(((uint32_t)(x)) << CAN_SR_TCS_SHIFT)) & CAN_SR_TCS_MASK)

#define CAN_SR_TBS_SHIFT                        (2)
#define CAN_SR_TBS_MASK                         (0x01U << CAN_SR_TBS_SHIFT)
#define CAN_SR_TBS(x)                           (((uint32_t)(((uint32_t)(x)) << CAN_SR_TBS_SHIFT)) & CAN_SR_TBS_MASK)

#define CAN_SR_DOS_SHIFT                        (1)
#define CAN_SR_DOS_MASK                         (0x01U << CAN_SR_DOS_SHIFT)
#define CAN_SR_DOS(x)                           (((uint32_t)(((uint32_t)(x)) << CAN_SR_DOS_SHIFT)) & CAN_SR_DOS_MASK)

#define CAN_SR_RBS_SHIFT                        (0)
#define CAN_SR_RBS_MASK                         (0x01U << CAN_SR_RBS_SHIFT)
#define CAN_SR_RBS(x)                           (((uint32_t)(((uint32_t)(x)) << CAN_SR_RBS_SHIFT)) & CAN_SR_RBS_MASK)

/*!
 * @brief
CAN_IR Register Bit Definition
 */

#define CAN_IR_BEI_SHIFT                        (7)
#define CAN_IR_BEI_MASK                         (0x01U << CAN_IR_BEI_SHIFT)
#define CAN_IR_BEI(x)                           (((uint32_t)(((uint32_t)(x)) << CAN_IR_BEI_SHIFT)) & CAN_IR_BEI_MASK)

