LengmoAngel/Rimuru/2.Firmware/Libraries/mm/Core/Inc/mm32f3273g.h
#define CAN_GROUPAMR_AM_SHIFT                  (0)
#define CAN_GROUPAMR_AM_MASK                   (0xFFU << CAN_GROUPAMR_AM_SHIFT)
#define CAN_GROUPAMR_AM(x)                     (((uint32_t)(((uint32_t)(x)) << CAN_GROUPAMR_AM_SHIFT)) & CAN_GROUPAMR_AM_MASK)

/*!
 * @}
 */ /* end of group CAN_Register_Masks */
/******************************************************************************
 * CAN Instance
******************************************************************************/
#define CAN_Basic                               ((CAN_Basic_Type*)CAN_BASE)
#define CAN_Peli                                ((CAN_Peli_Type*)CAN_BASE)

/*!
 * @}
 */ /* end of group CAN_Peripheral_Access_Layer */



/*!
 * @addtogroup USB_Peripheral_Access_Layer USB Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * USB Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t Reserved55[4];                                                   ///< Reserved
    __IO uint32_t FSOTGISTAT;                                                     ///< OTG Interrupt Status Register                offset: 0x10
    __IO uint32_t FSOTGICTRL;                                                     ///< OTG Interrupt Control Register               offset: 0x14
    __IO uint32_t FSOTGSTAT;                                                      ///< OTG Status Register                          offset: 0x18
    __IO uint32_t FSOTGCTRL;                                                      ///< OTG Control Register                         offset: 0x1C
    __IO uint32_t Reserved56[24];                                                  ///< Reserved
    __IO uint32_t FSINTSTAT;                                                      ///< Interrupt Status Register                    offset: 0x80
    __IO uint32_t FSINTENB;                                                       ///< Interrupt Enable Register                    offset: 0x84
    __IO uint32_t FSERRSTAT;                                                      ///< Error Interrupt Status Register              offset: 0x88
    __IO uint32_t FSERRENB;                                                       ///< Error Interrupt Enable Register              offset: 0x8C
    __IO uint32_t FSSTAT;                                                         ///< Status Register                              offset: 0x90
    __IO uint32_t FSCTL;                                                          ///< Control Register                             offset: 0x94
    __IO uint32_t FSADDR;                                                         ///< Address Register                             offset: 0x98
    __IO uint32_t FSBDTPAGE1;                                                     ///< BDT Page Register 1                          offset: 0x9C
    __IO uint32_t FSFRMNUML;                                                      ///< Frame Number Register                        offset: 0xA0
    __IO uint32_t FSFRMNUMH;                                                      ///< Frame Number Register                        offset: 0xA4
    __IO uint32_t FSTOKEN;                                                        ///< Token Register                               offset: 0xA8
    __IO uint32_t FSSOFTHLD;                                                      ///< SOF Threshold Register                       offset: 0xAC
    __IO uint32_t FSBDTPAGE2;                                                     ///< BDT Page Register 2                          offset: 0xB0
    __IO uint32_t FSBDTPAGE3;                                                     ///< BDT Page Register 3                          offset: 0xB4
    __IO uint32_t Reserved57[2];                                                   ///< Reserved
    __IO uint32_t FSEPCTL[16];                                                      ///< Endpoint control register 0                  offset: 0xC0
} USB_Type;

/*******************************************************************************
 * USB Type
 ******************************************************************************/

/*!
 * @addtogroup USB_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief USB_FS_OTGISTAT Register Bit Definition
 */

#define USB_FSOTGISTAT_IDCHG_SHIFT              (7)
#define USB_FSOTGISTAT_IDCHG_MASK               (0x01U << USB_FSOTGISTAT_IDCHG_SHIFT)
#define USB_FSOTGISTAT_IDCHG(x)                 (((uint32_t)(((uint32_t)(x)) << USB_FSOTGISTAT_IDCHG_SHIFT)) & USB_FSOTGISTAT_IDCHG_MASK)

#define USB_FSOTGISTAT_1MSEC_SHIFT              (6)
#define USB_FSOTGISTAT_1MSEC_MASK               (0x01U << USB_FSOTGISTAT_1MSEC_SHIFT)
#define USB_FSOTGISTAT_1MSEC(x)                 (((uint32_t)(((uint32_t)(x)) << USB_FSOTGISTAT_1MSEC_SHIFT)) & USB_FSOTGISTAT_1MSEC_MASK)

#define USB_FSOTGISTAT_LINESTATECHG_SHIFT       (5)
#define USB_FSOTGISTAT_LINESTATECHG_MASK        (0x01U << USB_FSOTGISTAT_LINESTATECHG_SHIFT)
#define USB_FSOTGISTAT_LINESTATECHG(x)          (((uint32_t)(((uint32_t)(x)) << USB_FSOTGISTAT_LINESTATECHG_SHIFT)) & USB_FSOTGISTAT_LINESTATECHG_MASK)

#define USB_FSOTGISTAT_SESSVLDCHG_SHIFT         (2)
#define USB_FSOTGISTAT_SESSVLDCHG_MASK          (0x01U << USB_FSOTGISTAT_SESSVLDCHG_SHIFT)
#define USB_FSOTGISTAT_SESSVLDCHG(x)            (((uint32_t)(((uint32_t)(x)) << USB_FSOTGISTAT_SESSVLDCHG_SHIFT)) & USB_FSOTGISTAT_SESSVLDCHG_MASK)

#define USB_FSOTGISTAT_BSESSENDCHG_SHIFT        (2)
#define USB_FSOTGISTAT_BSESSENDCHG_MASK         (0x01U << USB_FSOTGISTAT_BSESSENDCHG_SHIFT)
#define USB_FSOTGISTAT_BSESSENDCHG(x)           (((uint32_t)(((uint32_t)(x)) << USB_FSOTGISTAT_BSESSENDCHG_SHIFT)) & USB_FSOTGISTAT_BSESSENDCHG_MASK)

#define USB_FSOTGISTAT_AVBUSVLDCHG_SHIFT        (0)
#define USB_FSOTGISTAT_AVBUSVLDCHG_MASK         (0x01U << USB_FSOTGISTAT_AVBUSVLDCHG_SHIFT)
#define USB_FSOTGISTAT_AVBUSVLDCHG(x)           (((uint32_t)(((uint32_t)(x)) << USB_FSOTGISTAT_AVBUSVLDCHG_SHIFT)) & USB_FSOTGISTAT_AVBUSVLDCHG_MASK)

/*!
 * @brief USB_FS_OTGICTRL Register Bit Definition
 */

#define USB_FSOTGICTRL_IDEN_SHIFT               (7)
#define USB_FSOTGICTRL_IDEN_MASK                (0x01U << USB_FSOTGICTRL_IDEN_SHIFT)
#define USB_FSOTGICTRL_IDEN(x)                  (((uint32_t)(((uint32_t)(x)) << USB_FSOTGICTRL_IDEN_SHIFT)) & USB_FSOTGICTRL_IDEN_MASK)

