LengmoAngel/Rimuru/2.Firmware/Libraries/mm/Core/Inc/mm32f3273g.h
/*******************************************************************************
 * SDIO Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t MMCCTRL;                                                       ///< MMCCTRL                                     offset: 0x00
    __IO uint32_t MMCIO;                                                         ///< MMCIO                                       offset: 0x04
    __IO uint32_t MMCBYTECNTL;                                                   ///< MMCBYTECNTL                                 offset: 0x08
    __IO uint32_t MMCTRBLOCKCNT;                                                 ///< MMCTRBLOCKCNT                               offset: 0x0C
    __IO uint32_t MMCCRCCTL;                                                     ///< MMCCRCCTL                                   offset: 0x10
    __IO uint32_t CMDCRC;                                                        ///< CMDCRC                                      offset: 0x14
    __IO uint32_t DATCRCL;                                                       ///< DATCRCL                                     offset: 0x18
    __IO uint32_t DATCRCH;                                                       ///< DATCRCH                                     offset: 0x1C
    __IO uint32_t MMCPORT;                                                       ///< MMCPORT                                     offset: 0x20
    __IO uint32_t MMCINTMASK;                                                    ///< MMCINTMASK                                  offset: 0x24
    __IO uint32_t CLRMMCINT;                                                     ///< CLRMMCINT                                   offset: 0x28
    __IO uint32_t MMCCARDSEL;                                                    ///< MMCCARDSEL                                  offset: 0x2C
    __IO uint32_t MMCSIQ;                                                        ///< MMCSIQ                                      offset: 0x30
    __IO uint32_t MMCIOMBCTL;                                                    ///< MMCIOMBCTL                                  offset: 0x34
    __IO uint32_t MMCBLOCKCNT;                                                   ///< MMCBLOCKCNT                                 offset: 0x38
    __IO uint32_t MMCTIMEOUTCNT;                                                 ///< MMCTIMEOUTCN                                offset: 0x3C
    __IO uint32_t CMDBUF[16];                                                    ///< CMDBUFx (0..15)                             offset: 0x40
    __IO uint32_t BUFCTL;                                                       ///< BUFCTL                                      offset: 0x80
    __IO uint32_t Reserved36[31];                                                ///< Reserved
    __IO uint32_t DATABUF[126];                                                  ///< DATABUF                                     offset: 0x100
} SDIO_Type;

/*******************************************************************************
 * SDIO Type
 ******************************************************************************/

/*!
 * @addtogroup SDIO_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief SDIO_MMCCTRL Register Bit Definition
 */

#define SDIO_MMCCTRL_RDWTEN_SHIFT              (10)
#define SDIO_MMCCTRL_RDWTEN_MASK               (0x01U << SDIO_MMCCTRL_RDWTEN_SHIFT)
#define SDIO_MMCCTRL_RDWTEN(x)                 (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCTRL_RDWTEN_SHIFT)) & SDIO_MMCCTRL_RDWTEN_MASK)

#define SDIO_MMCCTRL_INTEN_SHIFT               (9)
#define SDIO_MMCCTRL_INTEN_MASK                (0x01U << SDIO_MMCCTRL_INTEN_SHIFT)
#define SDIO_MMCCTRL_INTEN(x)                  (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCTRL_INTEN_SHIFT)) & SDIO_MMCCTRL_INTEN_MASK)

#define SDIO_MMCCTRL_MDEN_SHIFT                (8)
#define SDIO_MMCCTRL_MDEN_MASK                 (0x01U << SDIO_MMCCTRL_MDEN_SHIFT)
#define SDIO_MMCCTRL_MDEN(x)                   (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCTRL_MDEN_SHIFT)) & SDIO_MMCCTRL_MDEN_MASK)

#define SDIO_MMCCTRL_DATWT_SHIFT               (7)
#define SDIO_MMCCTRL_DATWT_MASK                (0x01U << SDIO_MMCCTRL_DATWT_SHIFT)
#define SDIO_MMCCTRL_DATWT(x)                  (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCTRL_DATWT_SHIFT)) & SDIO_MMCCTRL_DATWT_MASK)

#define SDIO_MMCCTRL_SELPTSM_SHIFT             (6)
#define SDIO_MMCCTRL_SELPTSM_MASK              (0x01U << SDIO_MMCCTRL_SELPTSM_SHIFT)
#define SDIO_MMCCTRL_SELPTSM(x)                (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCTRL_SELPTSM_SHIFT)) & SDIO_MMCCTRL_SELPTSM_MASK)

#define SDIO_MMCCTRL_CLKSP_SHIFT               (3)
#define SDIO_MMCCTRL_CLKSP_MASK                (0x7U << SDIO_MMCCTRL_CLKSP_SHIFT)
#define SDIO_MMCCTRL_CLKSP(x)                  (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCTRL_CLKSP_SHIFT)) & SDIO_MMCCTRL_CLKSP_MASK)

#define SDIO_MMCCTRL_OUTM_SHIFT                (2)
#define SDIO_MMCCTRL_OUTM_MASK                 (0x01U << SDIO_MMCCTRL_OUTM_SHIFT)
#define SDIO_MMCCTRL_OUTM(x)                   (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCTRL_OUTM_SHIFT)) & SDIO_MMCCTRL_OUTM_MASK)

#define SDIO_MMCCTRL_SELSM_SHIFT               (1)
#define SDIO_MMCCTRL_SELSM_MASK                (0x01U << SDIO_MMCCTRL_SELSM_SHIFT)
#define SDIO_MMCCTRL_SELSM(x)                  (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCTRL_SELSM_SHIFT)) & SDIO_MMCCTRL_SELSM_MASK)

#define SDIO_MMCCTRL_OPMSEL_SHIFT              (0)
#define SDIO_MMCCTRL_OPMSEL_MASK               (0x01U << SDIO_MMCCTRL_OPMSEL_SHIFT)
#define SDIO_MMCCTRL_OPMSEL(x)                 (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCTRL_OPMSEL_SHIFT)) & SDIO_MMCCTRL_OPMSEL_MASK)

/*!
 * @brief SDIO_MMCIO Register Bit Definition
 */

#define SDIO_MMCIO_CMDAF_SHIFT                 (9)
#define SDIO_MMCIO_CMDAF_MASK                  (0x01U << SDIO_MMCIO_CMDAF_SHIFT)
#define SDIO_MMCIO_CMDAF(x)                    (((uint32_t)(((uint32_t)(x)) << SDIO_MMCIO_CMDAF_SHIFT)) & SDIO_MMCIO_CMDAF_MASK)

