LengmoAngel/Rimuru/2.Firmware/Libraries/mm/Core/Inc/mm32f3273g.h
#define SDIO_MMCINTMASK_CMDEINT_SHIFT         (3)
#define SDIO_MMCINTMASK_CMDEINT_MASK          (0x01U << SDIO_MMCINTMASK_CMDEINT_SHIFT)
#define SDIO_MMCINTMASK_CMDEINT(x)            (((uint32_t)(((uint32_t)(x)) << SDIO_MMCINTMASK_CMDEINT_SHIFT)) & SDIO_MMCINTMASK_CMDEINT_MASK)

#define SDIO_MMCINTMASK_DATEINT_SHIFT         (2)
#define SDIO_MMCINTMASK_DATEINT_MASK          (0x01U << SDIO_MMCINTMASK_DATEINT_SHIFT)
#define SDIO_MMCINTMASK_DATEINT(x)            (((uint32_t)(((uint32_t)(x)) << SDIO_MMCINTMASK_DATEINT_SHIFT)) & SDIO_MMCINTMASK_DATEINT_MASK)

#define SDIO_MMCINTMASK_DATDINT_SHIFT         (1)
#define SDIO_MMCINTMASK_DATDINT_MASK          (0x01U << SDIO_MMCINTMASK_DATDINT_SHIFT)
#define SDIO_MMCINTMASK_DATDINT(x)            (((uint32_t)(((uint32_t)(x)) << SDIO_MMCINTMASK_DATDINT_SHIFT)) & SDIO_MMCINTMASK_DATDINT_MASK)

#define SDIO_MMCINTMASK_CMDDINT_SHIFT         (0)
#define SDIO_MMCINTMASK_CMDDINT_MASK          (0x01U << SDIO_MMCINTMASK_CMDDINT_SHIFT)
#define SDIO_MMCINTMASK_CMDDINT(x)            (((uint32_t)(((uint32_t)(x)) << SDIO_MMCINTMASK_CMDDINT_SHIFT)) & SDIO_MMCINTMASK_CMDDINT_MASK)

/*!
 * @brief SDIO_CLRMMCINT Register Bit Definition
 */

#define SDIO_CLRMMCINT_D1MC_SHIFT             (8)
#define SDIO_CLRMMCINT_D1MC_MASK              (0x01U << SDIO_CLRMMCINT_D1MC_SHIFT)
#define SDIO_CLRMMCINT_D1MC(x)                (((uint32_t)(((uint32_t)(x)) << SDIO_CLRMMCINT_D1MC_SHIFT)) & SDIO_CLRMMCINT_D1MC_MASK)

#define SDIO_CLRMMCINT_CRCEMC_SHIFT           (7)
#define SDIO_CLRMMCINT_CRCEMC_MASK            (0x01U << SDIO_CLRMMCINT_CRCEMC_SHIFT)
#define SDIO_CLRMMCINT_CRCEMC(x)              (((uint32_t)(((uint32_t)(x)) << SDIO_CLRMMCINT_CRCEMC_SHIFT)) & SDIO_CLRMMCINT_CRCEMC_MASK)

#define SDIO_CLRMMCINT_CRNTMC_SHIFT           (6)
#define SDIO_CLRMMCINT_CRNTMC_MASK            (0x01U << SDIO_CLRMMCINT_CRNTMC_SHIFT)
#define SDIO_CLRMMCINT_CRNTMC(x)              (((uint32_t)(((uint32_t)(x)) << SDIO_CLRMMCINT_CRNTMC_SHIFT)) & SDIO_CLRMMCINT_CRNTMC_MASK)

#define SDIO_CLRMMCINT_MBTMC_SHIFT            (5)
#define SDIO_CLRMMCINT_MBTMC_MASK             (0x01U << SDIO_CLRMMCINT_MBTMC_SHIFT)
#define SDIO_CLRMMCINT_MBTMC(x)               (((uint32_t)(((uint32_t)(x)) << SDIO_CLRMMCINT_MBTMC_SHIFT)) & SDIO_CLRMMCINT_MBTMC_MASK)

#define SDIO_CLRMMCINT_MBDMC_SHIFT            (4)
#define SDIO_CLRMMCINT_MBDMC_MASK             (0x01U << SDIO_CLRMMCINT_MBDMC_SHIFT)
#define SDIO_CLRMMCINT_MBDMC(x)               (((uint32_t)(((uint32_t)(x)) << SDIO_CLRMMCINT_MBDMC_SHIFT)) & SDIO_CLRMMCINT_MBDMC_MASK)

#define SDIO_CLRMMCINT_CMDEMC_SHIFT           (3)
#define SDIO_CLRMMCINT_CMDEMC_MASK            (0x01U << SDIO_CLRMMCINT_CMDEMC_SHIFT)
#define SDIO_CLRMMCINT_CMDEMC(x)              (((uint32_t)(((uint32_t)(x)) << SDIO_CLRMMCINT_CMDEMC_SHIFT)) & SDIO_CLRMMCINT_CMDEMC_MASK)

#define SDIO_CLRMMCINT_DATEMC_SHIFT           (2)
#define SDIO_CLRMMCINT_DATEMC_MASK            (0x01U << SDIO_CLRMMCINT_DATEMC_SHIFT)
#define SDIO_CLRMMCINT_DATEMC(x)              (((uint32_t)(((uint32_t)(x)) << SDIO_CLRMMCINT_DATEMC_SHIFT)) & SDIO_CLRMMCINT_DATEMC_MASK)

#define SDIO_CLRMMCINT_DATDMC_SHIFT           (1)
#define SDIO_CLRMMCINT_DATDMC_MASK            (0x01U << SDIO_CLRMMCINT_DATDMC_SHIFT)
#define SDIO_CLRMMCINT_DATDMC(x)              (((uint32_t)(((uint32_t)(x)) << SDIO_CLRMMCINT_DATDMC_SHIFT)) & SDIO_CLRMMCINT_DATDMC_MASK)

#define SDIO_CLRMMCINT_CMDDMC_SHIFT           (0)
#define SDIO_CLRMMCINT_CMDDMC_MASK            (0x01U << SDIO_CLRMMCINT_CMDDMC_SHIFT)
#define SDIO_CLRMMCINT_CMDDMC(x)              (((uint32_t)(((uint32_t)(x)) << SDIO_CLRMMCINT_CMDDMC_SHIFT)) & SDIO_CLRMMCINT_CMDDMC_MASK)

/*!
 * @brief SDIO_MMCCARDSEL Register Bit Definition
 */

#define SDIO_MMCCARDSEL_CTREN_SHIFT            (7)
#define SDIO_MMCCARDSEL_CTREN_MASK             (0x01U << SDIO_MMCCARDSEL_CTREN_SHIFT)
#define SDIO_MMCCARDSEL_CTREN(x)               (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCARDSEL_CTREN_SHIFT)) & SDIO_MMCCARDSEL_CTREN_MASK)

#define SDIO_MMCCARDSEL_ENPCLK_SHIFT           (6)
#define SDIO_MMCCARDSEL_ENPCLK_MASK            (0x01U << SDIO_MMCCARDSEL_ENPCLK_SHIFT)
#define SDIO_MMCCARDSEL_ENPCLK(x)              (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCARDSEL_ENPCLK_SHIFT)) & SDIO_MMCCARDSEL_ENPCLK_MASK)

#define SDIO_MMCCARDSEL_TSCALE_SHIFT           (0)
#define SDIO_MMCCARDSEL_TSCALE_MASK            (0x3FU << SDIO_MMCCARDSEL_TSCALE_SHIFT)
#define SDIO_MMCCARDSEL_TSCALE(x)              (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCARDSEL_TSCALE_SHIFT)) & SDIO_MMCCARDSEL_TSCALE_MASK)

/*!
 * @brief SDIO_MMCSIQ Register Bit Definition
 */

#define SDIO_MMCSIQ_PCMDS_SHIFT                (7)
#define SDIO_MMCSIQ_PCMDS_MASK                 (0x01U << SDIO_MMCSIQ_PCMDS_SHIFT)
#define SDIO_MMCSIQ_PCMDS(x)                   (((uint32_t)(((uint32_t)(x)) << SDIO_MMCSIQ_PCMDS_SHIFT)) & SDIO_MMCSIQ_PCMDS_MASK)

#define SDIO_MMCSIQ_CRCSTATUS_SHIFT            (4)
#define SDIO_MMCSIQ_CRCSTATUS_MASK             (0x7U << SDIO_MMCSIQ_CRCSTATUS_SHIFT)
#define SDIO_MMCSIQ_CRCSTATUS(x)               (((uint32_t)(((uint32_t)(x)) << SDIO_MMCSIQ_CRCSTATUS_SHIFT)) & SDIO_MMCSIQ_CRCSTATUS_MASK)

#define SDIO_MMCSIQ_PDAT3S_SHIFT               (3)
#define SDIO_MMCSIQ_PDAT3S_MASK                (0x01U << SDIO_MMCSIQ_PDAT3S_SHIFT)
#define SDIO_MMCSIQ_PDAT3S(x)                  (((uint32_t)(((uint32_t)(x)) << SDIO_MMCSIQ_PDAT3S_SHIFT)) & SDIO_MMCSIQ_PDAT3S_MASK)

#define SDIO_MMCSIQ_PDAT2S_SHIFT               (2)
#define SDIO_MMCSIQ_PDAT2S_MASK                (0x01U << SDIO_MMCSIQ_PDAT2S_SHIFT)
#define SDIO_MMCSIQ_PDAT2S(x)                  (((uint32_t)(((uint32_t)(x)) << SDIO_MMCSIQ_PDAT2S_SHIFT)) & SDIO_MMCSIQ_PDAT2S_MASK)

#define SDIO_MMCSIQ_PDAT1S_SHIFT               (1)
#define SDIO_MMCSIQ_PDAT1S_MASK                (0x01U << SDIO_MMCSIQ_PDAT1S_SHIFT)
#define SDIO_MMCSIQ_PDAT1S(x)                  (((uint32_t)(((uint32_t)(x)) << SDIO_MMCSIQ_PDAT1S_SHIFT)) & SDIO_MMCSIQ_PDAT1S_MASK)

#define SDIO_MMCSIQ_PDAT0S_SHIFT               (0)
#define SDIO_MMCSIQ_PDAT0S_MASK                (0x01U << SDIO_MMCSIQ_PDAT0S_SHIFT)
#define SDIO_MMCSIQ_PDAT0S(x)                  (((uint32_t)(((uint32_t)(x)) << SDIO_MMCSIQ_PDAT0S_SHIFT)) & SDIO_MMCSIQ_PDAT0S_MASK)

/*!
 * @brief SDIO_MMCIOMBCTL Register Bit Definition
 */

