LengmoAngel/Rimuru/2.Firmware/Libraries/mm/Core/Inc/mm32f3273g.h
#define SDIO_MMCIOMBCTL_NTSSEL_SHIFT          (6)
#define SDIO_MMCIOMBCTL_NTSSEL_MASK           (0x3U << SDIO_MMCIOMBCTL_NTSSEL_SHIFT)
#define SDIO_MMCIOMBCTL_NTSSEL(x)             (((uint32_t)(((uint32_t)(x)) << SDIO_MMCIOMBCTL_NTSSEL_SHIFT)) & SDIO_MMCIOMBCTL_NTSSEL_MASK)

#define SDIO_MMCIOMBCTL_BTSSEL_SHIFT          (4)
#define SDIO_MMCIOMBCTL_BTSSEL_MASK           (0x3U << SDIO_MMCIOMBCTL_BTSSEL_SHIFT)
#define SDIO_MMCIOMBCTL_BTSSEL(x)             (((uint32_t)(((uint32_t)(x)) << SDIO_MMCIOMBCTL_BTSSEL_SHIFT)) & SDIO_MMCIOMBCTL_BTSSEL_MASK)

#define SDIO_MMCIOMBCTL_PCLKP_SHIFT           (3)
#define SDIO_MMCIOMBCTL_PCLKP_MASK            (0x01U << SDIO_MMCIOMBCTL_PCLKP_SHIFT)
#define SDIO_MMCIOMBCTL_PCLKP(x)              (((uint32_t)(((uint32_t)(x)) << SDIO_MMCIOMBCTL_PCLKP_SHIFT)) & SDIO_MMCIOMBCTL_PCLKP_MASK)

#define SDIO_MMCIOMBCTL_PAUTOTR_SHIFT         (2)
#define SDIO_MMCIOMBCTL_PAUTOTR_MASK          (0x01U << SDIO_MMCIOMBCTL_PAUTOTR_SHIFT)
#define SDIO_MMCIOMBCTL_PAUTOTR(x)            (((uint32_t)(((uint32_t)(x)) << SDIO_MMCIOMBCTL_PAUTOTR_SHIFT)) & SDIO_MMCIOMBCTL_PAUTOTR_MASK)

#define SDIO_MMCIOMBCTL_SMBDTD_SHIFT          (1)
#define SDIO_MMCIOMBCTL_SMBDTD_MASK           (0x01U << SDIO_MMCIOMBCTL_SMBDTD_SHIFT)
#define SDIO_MMCIOMBCTL_SMBDTD(x)             (((uint32_t)(((uint32_t)(x)) << SDIO_MMCIOMBCTL_SMBDTD_SHIFT)) & SDIO_MMCIOMBCTL_SMBDTD_MASK)

#define SDIO_MMCIOMBCTL_SPMBDTR_SHIFT         (0)
#define SDIO_MMCIOMBCTL_SPMBDTR_MASK          (0x01U << SDIO_MMCIOMBCTL_SPMBDTR_SHIFT)
#define SDIO_MMCIOMBCTL_SPMBDTR(x)            (((uint32_t)(((uint32_t)(x)) << SDIO_MMCIOMBCTL_SPMBDTR_SHIFT)) & SDIO_MMCIOMBCTL_SPMBDTR_MASK)

/*!
 * @brief SDIO_MMCBLOCKCNT Register Bit Definition
 */

#define SDIO_MMCBLOCKCNT_BCNT_SHIFT            (0)
#define SDIO_MMCBLOCKCNT_BCNT_MASK             (0xFFFFU << SDIO_MMCBLOCKCNT_BCNT_SHIFT)
#define SDIO_MMCBLOCKCNT_BCNT(x)               (((uint32_t)(((uint32_t)(x)) << SDIO_MMCBLOCKCNT_BCNT_SHIFT)) & SDIO_MMCBLOCKCNT_BCNT_MASK)

/*!
 * @brief SDIO_MMCTIMEOUTCNT Register Bit Definition
 */

#define SDIO_MMCTIMEOUTCNT_DTCNT_SHIFT         (0)
#define SDIO_MMCTIMEOUTCNT_DTCNT_MASK          (0xFFU << SDIO_MMCTIMEOUTCNT_DTCNT_SHIFT)
#define SDIO_MMCTIMEOUTCNT_DTCNT(x)            (((uint32_t)(((uint32_t)(x)) << SDIO_MMCTIMEOUTCNT_DTCNT_SHIFT)) & SDIO_MMCTIMEOUTCNT_DTCNT_MASK)

/*!
 * @brief SDIO_CMDBUF Register Bit Definition
 */

#define SDIO_CMDBUF_DAT_SHIFT                  (0)
#define SDIO_CMDBUF_DAT_MASK                   (0xFFU << SDIO_CMDBUF_DAT_SHIFT)
#define SDIO_CMDBUF_DAT(x)                     (((uint32_t)(((uint32_t)(x)) << SDIO_CMDBUF_DAT_SHIFT)) & SDIO_CMDBUF_DAT_MASK)

/*!
 * @brief SDIO_BUFCTL Register Bit Definition
 */

#define SDIO_BUFCTL_DBFEN_SHIFT                (15)
#define SDIO_BUFCTL_DBFEN_MASK                 (0x01U << SDIO_BUFCTL_DBFEN_SHIFT)
#define SDIO_BUFCTL_DBFEN(x)                   (((uint32_t)(((uint32_t)(x)) << SDIO_BUFCTL_DBFEN_SHIFT)) & SDIO_BUFCTL_DBFEN_MASK)

#define SDIO_BUFCTL_DRM_SHIFT                  (14)
#define SDIO_BUFCTL_DRM_MASK                   (0x01U << SDIO_BUFCTL_DRM_SHIFT)
#define SDIO_BUFCTL_DRM(x)                     (((uint32_t)(((uint32_t)(x)) << SDIO_BUFCTL_DRM_SHIFT)) & SDIO_BUFCTL_DRM_MASK)

#define SDIO_BUFCTL_DFIFOSM_SHIFT              (12)
#define SDIO_BUFCTL_DFIFOSM_MASK               (0x01U << SDIO_BUFCTL_DFIFOSM_SHIFT)
#define SDIO_BUFCTL_DFIFOSM(x)                 (((uint32_t)(((uint32_t)(x)) << SDIO_BUFCTL_DFIFOSM_SHIFT)) & SDIO_BUFCTL_DFIFOSM_MASK)

#define SDIO_BUFCTL_SBAD_SHIFT                 (11)
#define SDIO_BUFCTL_SBAD_MASK                  (0x01U << SDIO_BUFCTL_SBAD_SHIFT)
#define SDIO_BUFCTL_SBAD(x)                    (((uint32_t)(((uint32_t)(x)) << SDIO_BUFCTL_SBAD_SHIFT)) & SDIO_BUFCTL_SBAD_MASK)

#define SDIO_BUFCTL_DMAHEN_SHIFT               (10)
#define SDIO_BUFCTL_DMAHEN_MASK                (0x01U << SDIO_BUFCTL_DMAHEN_SHIFT)
#define SDIO_BUFCTL_DMAHEN(x)                  (((uint32_t)(((uint32_t)(x)) << SDIO_BUFCTL_DMAHEN_SHIFT)) & SDIO_BUFCTL_DMAHEN_MASK)

#define SDIO_BUFCTL_DBML_SHIFT                 (2)
#define SDIO_BUFCTL_DBML_MASK                  (0xFFU << SDIO_BUFCTL_DBML_SHIFT)
#define SDIO_BUFCTL_DBML(x)                    (((uint32_t)(((uint32_t)(x)) << SDIO_BUFCTL_DBML_SHIFT)) & SDIO_BUFCTL_DBML_MASK)

#define SDIO_BUFCTL_DBE_SHIFT                  (1)
#define SDIO_BUFCTL_DBE_MASK                   (0x01U << SDIO_BUFCTL_DBE_SHIFT)
#define SDIO_BUFCTL_DBE(x)                     (((uint32_t)(((uint32_t)(x)) << SDIO_BUFCTL_DBE_SHIFT)) & SDIO_BUFCTL_DBE_MASK)

#define SDIO_BUFCTL_DBF_SHIFT                  (0)
#define SDIO_BUFCTL_DBF_MASK                   (0x01U << SDIO_BUFCTL_DBF_SHIFT)
#define SDIO_BUFCTL_DBF(x)                     (((uint32_t)(((uint32_t)(x)) << SDIO_BUFCTL_DBF_SHIFT)) & SDIO_BUFCTL_DBF_MASK)

/*!
 * @brief SDIO_DATABUF Register Bit Definition
 */

#define SDIO_DATABUF_DB_SHIFT                  (0)
#define SDIO_DATABUF_DB_MASK                   (0xFFFFFFFFU << SDIO_DATABUF_DB_SHIFT)
#define SDIO_DATABUF_DB(x)                     (((uint32_t)(((uint32_t)(x)) << SDIO_DATABUF_DB_SHIFT)) & SDIO_DATABUF_DB_MASK)

/*!
 * @}
 */ /* end of group SDIO_Register_Masks */
/******************************************************************************
 * SDIO Instance
******************************************************************************/
#define SDIO                                ((SDIO_Type*)SDIO_BASE)

/*!
 * @}
 */ /* end of group SDIO_Peripheral_Access_Layer */



/*!
 * @addtogroup FSMC_Peripheral_Access_Layer FSMC Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * FSMC Type
 ******************************************************************************/
#define FSMC_SMTMGR_REG_NUM 3u /*!< the number of FSMC SMTMGR. */
typedef struct {
    __IO uint32_t Reserved37[21];                                                 ///< Reserved
    __IO uint32_t SMSKR[4];                                                       ///< Memory mask register                         offset: 0x54
    __IO uint32_t Reserved38[12];                                                 ///< Reserved
    __IO uint32_t SMTMGRSET[FSMC_SMTMGR_REG_NUM];                                 ///< Memory timing register 0                     offset: 0x94
    __IO uint32_t Reserved39[1];                                                  ///< Reserved
    __IO uint32_t SMCTLR;                                                         ///< Memory control register                      offset: 0xA4
} FSMC_Type;

