LengmoAngel/Rimuru/2.Firmware/Libraries/mm/Core/Inc/mm32f3273g.h
#define ADC_JDR_JVALID_SHIFT                    (22)
#define ADC_JDR_JVALID_MASK                     (0x01U << ADC_JDR_JVALID_SHIFT)
#define ADC_JDR_JVALID(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_JDR_JVALID_SHIFT)) & ADC_JDR_JVALID_MASK)

#define ADC_JDR_JOVERRUN_SHIFT                  (21)
#define ADC_JDR_JOVERRUN_MASK                   (0x01U << ADC_JDR_JOVERRUN_SHIFT)
#define ADC_JDR_JOVERRUN(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_JDR_JOVERRUN_SHIFT)) & ADC_JDR_JOVERRUN_MASK)

#define ADC_JDR_JDATA_SHIFT                     (0)
#define ADC_JDR_JDATA_MASK                      (0xFFFFU << ADC_JDR_JDATA_SHIFT)
#define ADC_JDR_JDATA(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JDR_JDATA_SHIFT)) & ADC_JDR_JDATA_MASK)

/*!
 * @}
 */ /* end of group ADC_Register_Masks */
/******************************************************************************
 * ADC Instance
******************************************************************************/
#define ADC1                                ((ADC_Type*)ADC1_BASE)
#define ADC2                                ((ADC_Type*)ADC2_BASE)
#define ADC3                                ((ADC_Type*)ADC3_BASE)

/*!
 * @}
 */ /* end of group ADC_Peripheral_Access_Layer */



/*!
 * @addtogroup DAC_Peripheral_Access_Layer DAC Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * DAC Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR;                                                             ///< DAC control register                         offset: 0x00
    __IO uint32_t SWTRIGR;                                                        ///< DAC software trigger register                offset: 0x04
    __IO uint32_t DHR12R1;                                                        ///< 12-bit right-justified data holding register for DAC channel 1 offset: 0x08
    __IO uint32_t DHR12L1;                                                        ///< DAC channel 1 12-bit left-justified data holding register offset: 0x0C
    __IO uint32_t DHR8R1;                                                         ///< 8-bit right-justified data holding register for DAC channel 1 offset: 0x10
    __IO uint32_t DHR12R2;                                                        ///< 12-bit right-justified data holding register for DAC channel 2 offset: 0x14
    __IO uint32_t DHR12L2;                                                        ///< 12-bit left-justified data holding register for DAC channel 2 offset: 0x18
    __IO uint32_t DHR8R2;                                                         ///< 8-bit right-justified data holding register for DAC channel 2 offset: 0x1C
    __IO uint32_t DHR12RD;                                                        ///< 12-bit right-justified data holding register for dual DAC offset: 0x20
    __IO uint32_t DHR12LD;                                                        ///< 12-bit left-justified data holding register for dual DAC offset: 0x24
    __IO uint32_t DHR8RD;                                                         ///< 8-bit right-justified data holding register for dual DAC offset: 0x28
    __IO uint32_t DOR1;                                                           ///< DAC channel 1 data output register           offset: 0x2C
    __IO uint32_t DOR2;                                                           ///< DAC channel 2 data output register           offset: 0x30
} DAC_Type;

/*******************************************************************************
 * DAC Type
 ******************************************************************************/

/*!
 * @addtogroup DAC_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief DAC_CR Register Bit Definition
 */

#define DAC_CR_DMAEN2_SHIFT                     (28)
#define DAC_CR_DMAEN2_MASK                      (0x01U << DAC_CR_DMAEN2_SHIFT)
#define DAC_CR_DMAEN2(x)                        (((uint32_t)(((uint32_t)(x)) << DAC_CR_DMAEN2_SHIFT)) & DAC_CR_DMAEN2_MASK)

#define DAC_CR_MAMP2_SHIFT                      (24)
#define DAC_CR_MAMP2_MASK                       (0xFU << DAC_CR_MAMP2_SHIFT)
#define DAC_CR_MAMP2(x)                         (((uint32_t)(((uint32_t)(x)) << DAC_CR_MAMP2_SHIFT)) & DAC_CR_MAMP2_MASK)

#define DAC_CR_WAVE2_SHIFT                      (22)
#define DAC_CR_WAVE2_MASK                       (0x03U << DAC_CR_WAVE2_SHIFT)
#define DAC_CR_WAVE2(x)                         (((uint32_t)(((uint32_t)(x)) << DAC_CR_WAVE2_SHIFT)) & DAC_CR_WAVE2_MASK)

#define DAC_CR_TSEL2_SHIFT                      (19)
#define DAC_CR_TSEL2_MASK                       (0x07U << DAC_CR_TSEL2_SHIFT)
#define DAC_CR_TSEL2(x)                         (((uint32_t)(((uint32_t)(x)) << DAC_CR_TSEL2_SHIFT)) & DAC_CR_TSEL2_MASK)

#define DAC_CR_TEN2_SHIFT                       (18)
#define DAC_CR_TEN2_MASK                        (0x01U << DAC_CR_TEN2_SHIFT)
#define DAC_CR_TEN2(x)                          (((uint32_t)(((uint32_t)(x)) << DAC_CR_TEN2_SHIFT)) & DAC_CR_TEN2_MASK)

#define DAC_CR_BOFF2_SHIFT                      (17)
#define DAC_CR_BOFF2_MASK                       (0x01U << DAC_CR_BOFF2_SHIFT)
#define DAC_CR_BOFF2(x)                         (((uint32_t)(((uint32_t)(x)) << DAC_CR_BOFF2_SHIFT)) & DAC_CR_BOFF2_MASK)

#define DAC_CR_EN2_SHIFT                        (16)
#define DAC_CR_EN2_MASK                         (0x01U << DAC_CR_EN2_SHIFT)
#define DAC_CR_EN2(x)                           (((uint32_t)(((uint32_t)(x)) << DAC_CR_EN2_SHIFT)) & DAC_CR_EN2_MASK)

#define DAC_CR_DMAEN1_SHIFT                     (12)
#define DAC_CR_DMAEN1_MASK                      (0x01U << DAC_CR_DMAEN1_SHIFT)
#define DAC_CR_DMAEN1(x)                        (((uint32_t)(((uint32_t)(x)) << DAC_CR_DMAEN1_SHIFT)) & DAC_CR_DMAEN1_MASK)

#define DAC_CR_MAMP1_SHIFT                      (8)
#define DAC_CR_MAMP1_MASK                       (0xFU << DAC_CR_MAMP1_SHIFT)
#define DAC_CR_MAMP1(x)                         (((uint32_t)(((uint32_t)(x)) << DAC_CR_MAMP1_SHIFT)) & DAC_CR_MAMP1_MASK)

#define DAC_CR_WAVE1_SHIFT                      (6)
#define DAC_CR_WAVE1_MASK                       (0x3U << DAC_CR_WAVE1_SHIFT)
#define DAC_CR_WAVE1(x)                         (((uint32_t)(((uint32_t)(x)) << DAC_CR_WAVE1_SHIFT)) & DAC_CR_WAVE1_MASK)

#define DAC_CR_TSEL1_SHIFT                      (3)
#define DAC_CR_TSEL1_MASK                       (0x7U << DAC_CR_TSEL1_SHIFT)
#define DAC_CR_TSEL1(x)                         (((uint32_t)(((uint32_t)(x)) << DAC_CR_TSEL1_SHIFT)) & DAC_CR_TSEL1_MASK)

